Revit 2026 API

# FailureDefinition Class

---

Defines persistent information about a failure.

SystemObject Autodesk.Revit.DBFailureDefinition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureDefinition : IDisposable
```
```vb
Public Class FailureDefinition
	Implements IDisposable
```
```cpp
public ref class FailureDefinition : IDisposable
```
```fsharp
type FailureDefinition =
    class
        interface IDisposable
    end
```

The FailureDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Severity | The severity of the failure. |

|  | Name | Description |
| --- | --- | --- |
|  | AddResolutionType | Adds a type of possible resolution for the failure. |
|  | CreateFailureDefinition | Creates an instance of a FailureDefinition. |
|  | Dispose | Releases all resources used by the FailureDefinition |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetApplicableResolutionTypes | Retrieves a list of resolution types applicable to the failure. |
|  | GetDefaultResolutionType | Retrieves the default resolution type for the failure. |
|  | GetDescriptionText | Retrieves the description text of the failure. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetResolutionCaption | Retrieves the caption for a specific resolution type. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasResolutions | Checks if the FailureDefinition has at least one resolution. |
|  | IsResolutionApplicable | Checks if the given resolution type is applicable to the failure. |
|  | SetDefaultResolutionType | Sets the default resolution type for the failure. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Each failure that can be potentially posted in Revit must be based on a FailureDefinition object that contains some persistent information about failure such as identity, severity, basic description text, types of resolution and default resolution. Each FailureMessage, which contains variable part of the information for a specific failure when it occurs, is created with a reference to a registered FailureDefinition. In order to be able to post a failure, one must define and register it via FailureDefinition object during Revit Application startup.

#### Reference

Autodesk.Revit.DB Namespace